Repository: Distrotech/findutils
Catalog: po/*.po
Languages: ro

source: invalid argument %s for %s
ro: argument invalid %s pentru %s

source: ambiguous argument %s for %s
ro: argument ambiguu %s pentru %s

source: Valid arguments are:
ro: Argumente valide sunt:

source: Unknown system error
ro: Eroare de sistem necunoscutã

source: %s: option `%s' is ambiguous
ro: %s: opþiunea `%s' este ambiguã

source: %s: option `--%s' doesn't allow an argument
ro: %s: opþiunea `--%s' nu permite un argument

source: %s: option `%c%s' doesn't allow an argument
ro: %s: opþiunea `%c%s' nu permite un argument

source: %s: option `%s' requires an argument
ro: %s: opþiunea `%s' necesitã un argument

source: %s: unrecognized option `--%s'
ro: %s: opþiune nerecunoscutã `--%s'

source: %s: unrecognized option `%c%s'
ro: %s: opþiune nerecunoscutã `%c%s'

source: %s: illegal option -- %c
ro: %s: opþiune ilegalã -- %c

source: %s: invalid option -- %c
ro: %s: opþiune ilegalã -- %c

source: %s: option requires an argument -- %c
ro: %s: opþiunea necesitã un argument -- %c

source: %s: option `-W %s' is ambiguous
ro: %s: opþiunea `-W %s' este ambiguã

source: %s: option `-W %s' doesn't allow an argument
ro: %s: opþiunea `-W %s' nu permite un argument

source: The environment variable FIND_BLOCK_SIZE is not supported, the only thing that affects the block size is the POSIXLY_CORRECT environment variable
ro: Variabila de mediu FIND_BLOCK_SIZE nu este suportatã, singurul lucru care afecteazã dimensiunea blocului esre variabila de mediu POSIXLY_CORRECT

source: paths must precede expression
ro: cãile trebuie specificate înaintea expresiei

source: invalid predicate `%s'
ro: predicat invalid `%s'

source: missing argument to `%s'
ro: argument lipsã pentru `%s'

source: invalid argument `%s' to `%s'
ro: argument invalid `%s' pentru `%s'

source: unexpected extra predicate
ro: predicat adiþional neaºteptat

source: cannot get current directory
ro: nu pot obþine directorul curent

source: Warning: filesystem %s has recently been unmounted.
ro: Avertisment: sistemul de fiºiere %s de fost demontat de curând.

source: Warning: filesystem %s has recently been mounted.
ro: Avertisment: sistemul de fiºiere %s de fost montat de curând.

source: %s%s changed during execution of %s (old device number %ld, new device number %ld, filesystem type is %s) [ref %ld]
ro: %s%s s-a schimbat în timpul execuþiei lui %s (vechiul nr. dispozitiv %ld, noul nr. dispozitiv %ld, tipul sistemului de fiºiere este %s) [ref %ld]

source: %s%s changed during execution of %s (old inode number %ld, new inode number %ld, filesystem type is %s) [ref %ld]
ro: %s%s s-a schimbat în timpul execuþiei lui %s (vechiul nr. inode %ld, noul nr. inode %ld, tipul sistemului de fiºiere este %s) [ref %ld]

source: Symbolic link `%s' is part of a loop in the directory hierarchy; we have already visited the directory to which it points.
ro: Legãtura simbolicã `%s' este parte a unei bucle în ierarhia de directoare; am vizitat deja directorul cãtre care þinteºte.

source: Filesystem loop detected; `%s' has the same device number and inode as a directory which is %d %s.
ro: Am detectat o buclã în sistemul de fiºiere; `%s' are acelaºi numãr de unitate ºi inode ca ºi un director care este %d %s.

source: level higher in the filesystem hierarchy
ro: nivel mai înalt în ierarhia sistemului de fiºiere

source: levels higher in the filesystem hierarchy
ro: nivele mai înalte în ierarhia sistemului de fiºiere

source: warning: not following the symbolic link %s
ro: avertisment: nu urmez legãtura simbolicã %s

source: WARNING: Hard link count is wrong for %s: this may be a bug in your filesystem driver. Automatically turning on find's -noleaf option. Earlier results may have failed to include directories that should have been searched.
ro: AVERTISMENT: Numãrul de legãturi hard este greºit pentru %s: acesta ar putea fi un bug în driverul dvs. pentru sistemul de fiºiere. Pornesc automat opþiunea -noleaf a lui find. Rezultatele precedente ar fi putut eºua sã includã directoare care ar fi trebuit cãutate.

source: unknown
ro: necunoscut

source: warning: you have specified the %s option after a non-option argument %s, but options are not positional (%s affects tests specified before it as well as those specified after it). Please specify options before other arguments.
ro: avertisment: aþi specificat opþiunea %s dupã un argument non-opþiune %s, dar opþiunile nu sunt poziþionale (%s afecteazã testele specificate înainte de el ca ºi cele specificate dupã el). Vã rugãm specificaþi opþiunile înainte de alte argumente.

source: warning: the -d option is deprecated; please use -depth instead, because the latter is a POSIX-compliant feature.
ro: avertisment: opþiunea -d nu mai este validã; vã rugãm folosiþi -depth în locul lui, pentru cã aceasta din urmã respectã standardul POSIX.

source: Usage: %s [path...] [expression]
ro: Folosire : %s [cale...] [expresie]

source: default path is the current directory; default expression is -print expression may consist of: operators, options, tests, and actions:
ro: calea implicitã este directorul curent; expresia implicitã este -print expresia poate fi compusã din: operatori opþiuni, teste ºi acþiuni:

source: operators (decreasing precedence; -and is implicit where no others are given): ( EXPR ) ! EXPR -not EXPR EXPR1 -a EXPR2 EXPR1 -and EXPR2 EXPR1 -o EXPR2 EXPR1 -or EXPR2 EXPR1 , EXPR2
ro: operatori (precedenþa în scãdere; -and este implicit când alþii nu sunt precizaþi): ( EXPR ) ! EXPR -not EXPR EXPR1 -a EXPR2 EXPR1 -and EXPR2 EXPR1 -o EXPR2 EXPR1 -or EXPR2 EXPR1 , EXPR2

source: positional options (always true): -daystart -follow -regextype normal options (always true, specified before other expressions): -depth --help -maxdepth LEVELS -mindepth LEVELS -mount -noleaf --version -xdev -ignore_readdir_race -noignore_readdir_race
ro: opþiuni poziþionale (întotdeauna adevãrat): -daystart -follow -regextype opþiuni normale (întotdeauna adevãrat, specificate înaintea altor expresii): -depth --help -maxdepth LEVELS -mindepth LEVELS -mount -noleaf --version -xdev -ignore_readdir_race -noignore_readdir_race

source: tests (N can be +N or -N or N): -amin N -anewer FILE -atime N -cmin N -cnewer FILE -ctime N -empty -false -fstype TYPE -gid N -group NAME -ilname PATTERN -iname PATTERN -inum N -iwholename PATTERN -iregex PATTERN -links N -lname PATTERN -mmin N -mtime N -name PATTERN -newer FILE
ro: teste (N poate fi +N sau -N sau N): -amin N -anewer FIªIER -atime N -cmin N -cnewer FIªIER -ctime N -empty -false -fstype TIP -gid N -group NUME -ilname PATTERN -iname PATTERN -inum N -iwholename PATTERN -iregex PATTERN -links N -lname PATTERN -mmin N -mtime N -name PATTERN -newer FIªIER

source: -nouser -nogroup -path PATTERN -perm [+-]MODE -regex PATTERN -wholename PATTERN -size N[bcwkMG] -true -type [bcdpflsD] -uid N -used N -user NAME -xtype [bcdpfls]
ro: -nouser -nogroup -path PATTERN -perm [+-]MOD -regex PATTERN -wholename PATTERN -size N[bcwkMG] -true -type [bcdpflsD] -uid N -used N -user NUME -xtype [bcdpfls]

source: actions: -delete -print0 -printf FORMAT -fprintf FILE FORMAT -print -fprint0 FILE -fprint FILE -ls -fls FILE -prune -quit -exec COMMAND ; -exec COMMAND {} + -ok COMMAND ; -execdir COMMAND ; -execdir COMMAND {} + -okdir COMMAND ;
ro: acþiuni: -delete -print0 -printf FORMAT -fprintf FORMAT FIªIER -print -fprint0 FIªIER -fprint FIªIER -ls -fls FIªIER -prune -quit -exec COMANDÃ ; -exec COMANDÃ {} + -ok COMANDÃ ; -execdir COMANDÃ ; -execdir COMANDÃ {} + -okdir COMANDÃ ;

source: Report (and track progress on fixing) bugs via the findutils bug-reporting page at http://savannah.gnu.org/ or, if you have no web access, by sending email to <bug-findutils@gnu.org>.
ro: Raportaþi (ºi urmãriþi progresul reparãrii) bug-urilor folosind pagina de raportare a bug-urilor din findutils de la http://savannah.gnu.org/ sau, dacã nu aveþi acces la internet, trimiþând email la <bug-findutils@gnu.org>.

source: sanity check of the fnmatch() library function failed.
ro: verificarea corectitudinii funcþie de bibliotecã fnmatch() a eºuat.

source: warning: Unix filenames usually don't contain slashes (though pathnames do). That means that '%s %s' will probably evaluate to false all the time on this system. You might find the '-wholename' test more useful, or perhaps '-samefile'. Alternatively, if you are using GNU grep, you could use 'find ... -print0 | grep -FzZ %s'.
ro: avertisment: de obicei, numele de fiºiere în Unix nu conþin shash-uri (dar numele de cãi da). Aceasta înseamnã cã '%s %s' va fi evaluat ca fals tot timpul pe acest sistem. Aþi putea gãsi testul '-wholename' mai folositor, sau probabil '-samefile'. Alternativ, dacã folosiþi GNU grep, puteþi folosi 'find ... -print0 | grep -FzZ %s'.

source: warning: the predicate -ipath is deprecated; please use -iwholename instead.
ro: avertisment: predicatul -ipath nu mai este valid; vã rugã sã folosiþi -iwholename în locul lui.

source: invalid mode `%s'
ro: mod invalid `%s'

source: invalid null argument to -size
ro: argument null invalid pentru -size

source: invalid -size type `%c'
ro: tip -size invalid `%c'

source: GNU find version %s
ro: GNU find versiunea %s

source: Features enabled:
ro: Capabilitãþi activate:

source: warning: unrecognized escape `\%c'
ro: avertisment: escape nerecunoscut `\%c'

source: warning: unrecognized format directive `%%%c'
ro: avertisment: directivã format nerecunoscutã `%%%c'

source: The current directory is included in the PATH environment variable, which is insecure in combination with the %s action of find. Please remove the current directory from your $PATH (that is, remove "." or leading or trailing colons)
ro: Directorul curent este inclus în variabila de mediu PATH, ceea ce este periculos (insecure) în combinaþie cu acþiune %s a lui find. Vã rugãm îndepãrtaþi directorul curent din $PATH (adicã îndepãrtaþi "." sau primul sau ultimul ":")

source: You may not use {} within the utility name for -execdir and -okdir, because this is a potential security problem.
ro: Nu puteþi folosi {} în cadrul numelui utilitarului pentru -execdir ºi -okdir, pentru cã aceasta este o potenþialã problemã de securitate.

source: Only one instance of {} is supported with -exec%s ... +
ro: Numai o singurã instanþã de {} este suportatã cu -exec%s ... +

source: cannot fork
ro: nu pot executa fork

source: error waiting for %s
ro: eroare aºteptând pentru %s

source: %s terminated by signal %d
ro: %s terminat de semnal %d

source: invalid expression
ro: expresie invalidã

source: invalid expression; you have used a binary operator with nothing before it.
ro: expresie invalidã; aþi folosit un operator binar cu nimic înaintea sa.

source: invalid expression; you have too many ')'
ro: expresie invalidã; aveþi prea multe ')'

source: invalid expression; I was expecting to find a ')' somewhere but did not see one.
ro: expresie invalidã; aºteptam sã gãsesc o ')' pe undeva, dar nu am gãsit-o.

source: oops -- invalid expression type!
ro: hopa -- tip expresie invalid!

source: oops -- invalid expression type (%d)!
ro: hopa -- tip expresie invalid (%d)!

source: oops -- invalid expression type in mark_stat!
ro: hopa -- tip expresie invalid în mark_stat!

source: oops -- invalid expression type in mark_type!
ro: hopa -- tip expresie invalid în mark_type!

source: oops -- invalid default insertion of and!
ro: hopa -- inserare implicitã invalidã de and!

source: Usage: %s [-H] [-L] [-P] [path...] [expression]
ro: Folosire : %s [-H] [-L] [-P] [cale...] [expresie]

source: command too long
ro: comandã prea lungã

source: can not fit single argument within argument list size limit
ro: nu pot potrivi un singur argument în limita dimensiunii listei de argumente

source: argument list too long
ro: listã argumente prea lungã

source: Usage: %s [--version | --help] or %s most_common_bigrams < file-list > locate-database
ro: Folosire: %s [--version | --help] sau %s cele_mai_comune_bigrame < listã-fisiere > baza-de-date-locate

source: Report bugs to <bug-findutils@gnu.org>.
ro: Raportaþi bug-uri la <bug-findutils@gnu.org>.

source: GNU findutils version %s
ro: GNU findutils versiunea %s

source: GNU locate version %s
ro: GNU locate versiunea %s

source: days
ro: zile

source: locate database `%s' is corrupt or invalid
ro: baza de date locate `%s' este coruptã sau invalidã

source: Locate database size: %s bytes
ro: Dimensiune baza de date locate: %s octeþi

source: Filenames: %s
ro: Nume fiºiere: %s

source: with a cumulative length of %s bytes
ro: cu o lungime cumulativã de %s octeþi

source: of which %s contain whitespace,
ro: din care %s conþin spaþii albe,

source: %s contain newline characters,
ro: %s conþin caractele linie-nouã,

source: and %s contain characters with the high bit set.
ro: ºi %s conþin caractere cu bitul înalt setat.

source: Compression ratio %4.2f%%
ro: Raport de compresie %4.2f%%

source: warning: the locate database can only be read from stdin once.
ro: avertisment: baza de date locate poate fi doar cititã de la stdin o datã.

source: warning: database `%s' is more than %d %s old
ro: avertisment: baza de date `%s' este mai veche de %d %s

source: Database %s is in the %s format.
ro: Baza de date %s este în formatul %s.

source: old
ro: vechi

source: environment is too large for exec
ro: mediul (environment) este prea larg pentru exec

source: GNU xargs version %s
ro: GNU xargs versiunea %s

source: Cannot open input file `%s'
ro: Nu pot deschide fiºierul de intrare `%s'

source: Maximum length of command we could actually use: %ld
ro: Lungimea mazimã a unei comenzi pe care o putem în fapt folosi: %ld

source: unmatched %s quote; by default quotes are special to xargs unless you use the -0 option
ro: ghilimele %s fãrã pereche; în mod implicit ghilimelele sunt speciale pentru xargs, în afarã de cazul în care folosiþi opþiunea -0

source: double
ro: dublu

source: single
ro: singur

source: argument line too long
ro: linie argumente prea lungã

source: error waiting for child process
ro: eroare aºteptând pentru procese copil

source: %s: exited with status 255; aborting
ro: %s: a terminat cu starea 255; renunþ

source: %s: stopped by signal %d
ro: %s: oprit de semnalul %d

source: %s: terminated by signal %d
ro: %s: terminat de semnalul %d

source: %s: invalid number for -%c option
ro: %s: numãr invalid pentru opþiunea -%c

source: %s: value for -%c option should be >= %ld
ro: %s: valoarea pentru opþiunea -%c ar trebui sã fie >= %ld

source: %s: value for -%c option should be < %ld
ro: %s: valoarea pentru opþiunea -%c ar trebui sã fie < %ld
